roles/doom/files/.doom.d/config.org
#+property: header-args:elisp :tangle config.el
#+startup: fold

#+TITLE: Doom Emacs config
#+author: Luke Piotrak
#+email: luke.piotrak

My Doom Emacs configuration. Most snippets have been copied from various places, including:

 - [[https://github.com/jethrokuan/dots/blob/master/.doom.d/config.el][jethrokuan/dots]]
 - [[https://tecosaur.github.io/emacs-config/config.html][tecosaur's emacs config]]

If you'd like to roll your own literate config I highly recommend the [[https://leanpub.com/lit-config/read][excellent guide]] by [[https://zzamboni.org/post/][Diego Zamboni]].

* Table of contents :TOC_4:noexport:
- [[#useful-resources][Useful resources]]
- [[#a-note-on-this-files-structure][A note on this file's structure]]
- [[#literate-config-setup][Literate config setup]]
- [[#general][General]]
- [[#custom-keymap][Custom Keymap]]
- [[#appearance][Appearance]]
- [[#org][Org]]
  - [[#general-org-mode][General Org-mode]]
  - [[#org-mode-appearance][Org-mode appearance]]
  - [[#org-agenda-and-gtd][Org Agenda and GTD]]
    - [[#org-capture-setup][Org Capture setup]]
    - [[#tags][Tags]]
    - [[#custom-functions-for-gtd][Custom functions for GTD]]
  - [[#org-roam][Org Roam]]
  - [[#org-roam-server][Org Roam server]]
    - [[#org-roam-capture-templates][Org roam capture templates]]
  - [[#org-pomodoro][Org Pomodoro]]
  - [[#org-ref][Org-ref]]
- [[#auctex][AUCTeX]]
  - [[#appearance-1][Appearance]]
- [[#file-templates][File templates]]
  - [[#configel][config.el]]
  - [[#initel][init.el]]
  - [[#packagesel][packages.el]]

* Useful resources

Before we begin, here are a list of resources I have found useful when configuring and using Emacs:
- [[https://leanpub.com/lit-config/read#leanpub-auto-tips-and-tricks][Read Literate Configuration | Leanpub]]
- [[https://blog.jethro.dev/posts/capturing_inbox/][Org-mode Workflow Part 1: Capturing in the Inbox · Jethro Kuan]]
- [[https://narra.co.za/doom-tips-and-howtos/][Doom Tips and Howtos - Narra's Place]] 

* A note on this file's structure
This file generates all three Doom configuration files (namely, [[file:init.el][init.el]], [[file:config.el][config.el]] and [[file:packages.el][packages.el]]). This makes it possible to group snippets from all three files pertaining to a logical part of the Emacs ecosystem to live under one heading. I find this more logical, and easier to manage, rather than the default Doom Emacs split.

The templates for all three files can be found at the bottom of this config.

* Literate config setup
:PROPERTIES:
:header-args:elisp: :noweb-ref preamble
:END:

First of all, I want the configs to be nice and comfy to edit, so let's do that.
The hook below automatically generates the configs once this file is saved.

#+begin_src elisp
(add-hook 'org-mode-hook
          (lambda () (add-hook 'after-save-hook #'org-babel-tangle
                               :append :local)))
#+end_src

Pdf tools is needed for generating the files. It is also used in org-noter
#+begin_src elisp
(pdf-tools-install)
#+end_src
* General
:PROPERTIES:
:header-args:elisp: :noweb-ref preamble
:END:

Enable fuzzy searching in search buffers
#+begin_src elisp :noweb-ref ivy-init.el
(ivy +fuzzy)
#+end_src

Set autosaving
#+begin_src elisp
(setq auto-save-visited-mode t)
#+end_src

line numbers
#+begin_src elisp
(setq display-line-numbers-type nil)
#+end_src

Make avy text searches span all windows
#+begin_src elisp
(setq avy-all-windows t)
#+end_src

Bookmarks get saved to with every modification
#+begin_src elisp
(setq bookmark-save-flag 1)
#+end_src

Always show hints for ace-window so it is easy to see which window we can jump to
#+begin_src elisp
(define-globalized-minor-mode ace-window-display-mode-global ace-window-display-mode
  (lambda () (ace-window-display-mode 1)))
(ace-window-display-mode-global 1)
#+end_src

Centaur tabs
#+begin_src elisp
(after! centaur-tabs
  (centaur-tabs-mode 1)
  (setq centaur-tabs-height 36
        centaur-tabs-set-icons t
        centaur-tabs-modified-marker "o"
        centaur-tabs-close-button "×"
        centaur-tabs-set-bar 'above
        centaur-tabs-gray-out-icons 'buffer)
  )
#+end_src

* Custom Keymap
:PROPERTIES:
:header-args:elisp: :noweb-ref preamble
:END:

Delete current file and buffer keymap
#+begin_src elisp
(defun delete-file-and-buffer ()
  "Kill the current buffer and deletes the file it is visiting."
  (interactive)
  (let ((filename (buffer-file-name)))
    (if filename
        (if (y-or-n-p (concat "Do you really want to delete file " filename " ?"))
            (progn
              (delete-file filename)
              (message "Deleted file %s." filename)
              (kill-buffer)))
      (message "Not a file visiting buffer!"))))

(map! :leader
      :prefix "b"
      :desc "delete-file-and-buffer" "D" #'delete-file-and-buffer)
#+end_src

Make evil-mode up/down operate in screen lines instead of logical lines
#+begin_src elisp
(define-key evil-motion-state-map "j" 'evil-next-visual-line)
(define-key evil-motion-state-map "k" 'evil-previous-visual-line)
;; Also in visual mode
(define-key evil-visual-state-map "j" 'evil-next-visual-line)
(define-key evil-visual-state-map "k" 'evil-previous-visual-line)
#+end_src

Replace with register
#+begin_src elisp :noweb-ref packages
(package! evil-replace-with-register
  :recipe (:host github :repo "Dewdrops/evil-ReplaceWithRegister"))
#+end_src

#+begin_src elisp
(require 'evil-replace-with-register)
(setq evil-replace-with-register-key (kbd "gr"))
(evil-replace-with-register-install)
#+end_src

Undo / redo action
#+begin_src elisp
(winner-mode +1)
(map! :map winner-mode-map
      "<C-M-right>" #'winner-redo
      "<C-M-left>" #'winner-undo)
#+end_src

Undo / redo movement
#+begin_src elisp
(map! :leader
      "<M-left>" #'avy-pop-mark)
#+end_src
* Appearance
:PROPERTIES:
:header-args:elisp: :noweb-ref preamble
:END:

Let's go ahead and set the beautiful Hack font with all the bells and whistles. Can be found [[https://github.com/pyrho/hack-font-ligature-nerd-font/blob/master/font/Hack%20Regular%20Nerd%20Font%20Complete%20Mono.ttf/][here]] (thanks [[https://github.com/pyrho][pyrho]]).
#+begin_src elisp
(setq doom-font (font-spec :family "Hack Nerd Font Mono" :size 15 :height 1.0)
      doom-variable-pitch-font (font-spec :family "Newsreader" :height 1.0 :size 17)
      )
#+end_src

Ligatures. I like ligatures
#+begin_src elisp :noweb-ref ligatures-init.el
(ligatures)
#+end_src

Set the theme:
First define the external package in packages.el
#+begin_src elisp :noweb-ref packages
(package! spacemacs-theme)
#+end_src
And set in config.el
#+begin_src elisp
(setq doom-theme 'spacemacs-light)
#+end_src

Disable solaire mode and line highlighting
#+begin_src elisp
  (setq solaire-global-mode -1)
  (setq global-hl-line-mode -1)
#+end_src

#+RESULTS:
: -1

* Org
:PROPERTIES:
:header-args:elisp: :noweb-ref preamble
:END:

I have recently begun to use org-mode quite heavily. Mainly for tracking todos and note-taking using org-roam.

** General Org-mode

Enable org-mode module with extras in init.el
#+begin_src elisp :noweb-ref org-init.el
(org +dragndrop +roam +pomodoro +pretty +noter :tools pdf)
                                        ;organize your plain life in plain text
#+end_src

Define where org files can be found
#+begin_src elisp

(require 'find-lisp)
(setq org-directory "~/Dropbox/org/"
      jethro/org-agenda-directory (concat org-directory "gtd/")
      org-agenda-files (find-lisp-find-files jethro/org-agenda-directory "\.org$")
      org-startup-folded 'overview)
#+end_src

Todo keywords
#+begin_src elisp 
(setq org-todo-keywords
      '((sequence "TODO(t)" "NEXT(n)" "HOLD(h)" "|" "DONE(d)")
        ))
#+end_src

Custom column display
#+begin_src elisp
  (setq org-columns-default-format "%40ITEM(Task) %Effort(EE){:} %CLOCKSUM(Time Spent) %SCHEDULED(Scheduled) %DEADLINE(Deadline)")
#+end_src
