roles/doom/files/.doom.d/config.el
(use-package! mixed-pitch
  :hook (org-mode . mixed-pitch-mode)
  :config
  (setq mixed-pitch-set-height t)
  (set-face-attribute 'variable-pitch nil :height 1.3))

(add-hook 'org-mode-hook :append :local
          (lambda ()
            (mixed-pitch-mode 1)
            (hl-line-mode -1)
            (set-left-margin 4)
            (set-right-margin 4)
            (set-window-buffer nil (current-buffer))))

(setq line-spacing 0.1
      header-line-format " "
      )

(setq org-startup-indented t
      org-superstar-headline-bullets-list '(" ") ;; no bullets, needs org-bullets package
      org-ellipsis "  " ;; folding symbol
      org-pretty-entities t
      org-hide-emphasis-markers t
      ;; show actually italicized text instead of /italicized text/
      org-agenda-block-separator ""
      org-fontify-whole-heading-line t
      org-fontify-done-headline t
      org-fontify-quote-and-verse-blocks t)
(setq-local
 bg-white           "#fbf8ef"
 bg-light           "#222425"
 bg-dark            "#1c1e1f"
 bg-darker          "#1c1c1c"
 fg-white           "#ffffff"
 shade-white        "#efeae9"
 fg-light           "#655370"
 dark-cyan          "#008b8b"
 region-dark        "#2d2e2e"
 region             "#39393d"
 slate              "#8FA1B3"
 keyword            "#f92672"
 comment            "#525254"
 builtin            "#fd971f"
 purple             "#9c91e4"
 doc                "#727280"
 type               "#66d9ef"
 string             "#b6e63e"
 gray-dark          "#999"
 gray               "#bbb"
 sans-font          "Hack Nerd Font Mono"
 serif-font         "Newsreader"
 et-font            "Newsreader"
 sans-mono-font     "Hack Nerd Font Mono"
 serif-mono-font    "Verily Serif Mono")

(custom-theme-set-faces
 'user
 `(variable-pitch

   ( (t (:family ,et-font
         :foreground ,bg-dark
         :background ,bg-white
         :height 1.7) ) ))
 `(org-document-title

   ( (t (:inherit nil
         :family ,et-font
         :height 1.8
         :foreground ,bg-dark
         :underline nil) ) ))
 `(org-document-info

   ( (t (:height 1.2
         :slant italic) ) ))
 `(org-level-1

   ( (t (:inherit nil
         :family ,et-font
         :height 1.6
         :weight normal
         :slant normal
         :foreground ,bg-dark) ) ))
 `(org-level-2

   ( (t (:inherit nil
         :family ,et-font
         :weight normal
         :height 1.3
         :slant italic
         :foreground ,bg-dark) ) ))
 `(org-level-3

   ( (t (:inherit nil
         :family ,et-font
         :weight normal
         :slant italic
         :height 1.2
         :foreground ,bg-dark) ) ))
 `(org-level-4

   ( (t (:inherit nil
         :family ,et-font
         :weight normal
         :slant italic
         :height 1.1
         :foreground ,bg-dark) ) ))
 `(org-level-5
   ( (t (:inherit variable-pitch
         :weight bold
         :height 1.1
         :foreground ,slate) ) )
   )
 `(org-level-6
   ( (t (:inherit variable-pitch
         :weight bold
         :height 1.1
         :foreground ,slate) ) )
   )
 `(org-level-7
   ( (t (:inherit variable-pitch
         :weight bold
         :height 1.1
         :foreground ,slate) ) )
   )
 `(org-level-8
   ( (t (:inherit variable-pitch
         :weight bold
         :height 1.1
         :foreground ,slate) ) )
   )
 `(org-headline-done

   ( (t (:family ,et-font
         :strike-through t) ) ))
 `(org-quote
   ( (t (:background ,bg-light) ) )
   )
 `(org-block

   ( (t (:background nil
         :foreground ,bg-dark) ) ))
 `(org-block-begin-line

   ( (t (:background nil
         :height 0.8
         :family ,sans-mono-font
         :foreground ,bg-dark) ) ))
 `(org-block-end-line

   ( (t (:background nil
         :height 0.8
         :family ,sans-mono-font
         :foreground ,bg-dark) ) ))
 `(org-document-info-keyword

   ( (t (:height 0.8
         :foreground ,gray) ) ))
 `(org-link

   ( (t (:foreground ,bg-dark) ) ))
 `(org-special-keyword

   ( (t (:family ,sans-mono-font
         :height 0.8) ) ))
 `(org-todo
   ( (t (:inherit variable-pitch :height 0.8) ) )
   )
 `(org-done
   ( (t (:inherit variable-pitch
         :height 0.8
         :strike-through t
         ) ) )
   )
 `(org-agenda-current-time
   ( (t (:foreground ,slate) ) )
   )
 `(org-hide
   ( (t (:foreground ,bg-white) ) ))
 `(org-indent
   ( (t (:inherit org-hide) ) )
   )
 `(org-time-grid
   ( (t (:foreground ,comment) ) )
   )
 `(org-warning
   ( (t (:foreground ,builtin) ) )
   )
 `(org-date
   ( (t (:family ,sans-mono-font
         :height 0.8) ) ))
 `(org-agenda-structure
   ( (t (:height 1.3
         :foreground ,doc
         :weight normal
         :inherit variable-pitch) ) )
   )
 `(org-agenda-date

   ( (t (:inherit variable-pitch
         :height 1.1) ) ))
 `(org-agenda-date-today
   ( (t (:height 1.5
         :foreground ,dark-cyan
         :inherit variable-pitch) ) )
   )
 `(org-agenda-date-weekend
   ( (t (:inherit org-agenda-date) ) )
   )
 `(org-scheduled
   ( (t (:foreground ,gray) ) )
   )
 `(org-upcoming-deadline
   ( (t (:foreground ,keyword) ) )
   )
 `(org-scheduled-today
   ( (t (:foreground ,fg-white) ) )
   )
 `(org-scheduled-previously
   ( (t (:foreground ,slate) ) )
   )
 `(org-agenda-done
   ( (t (:strike-through t) ) ))
 `(org-ellipsis

   ( (t (:underline nil
         :foreground ,comment) ) ))
 `(org-tag

   ( (t (:foreground ,doc) ) ))
 `(org-table

   ( (t (:family ,serif-mono-font
         :height 0.9
         :background ,bg-white) ) ))
 `(org-code

   ( (t (:inherit
         :family ,serif-mono-font
         :foreground ,comment
         :height 0.7) ) ))
 `(mode-line
   ( (t (:background ,bg-white) ) ))
 )
(map! :leader
      "C" #'org-capture)

(setq org-capture-templates
      `(("i" "Inbox" entry (file ,(concat jethro/org-agenda-directory "inbox.org"))
         ,(concat "* TODO %?\n"
                  "/Entered on/ %u \n"
                  "What is the first step for this task?"))
        ("c" "org-protocol-capture" entry (file ,(concat jethro/org-agenda-directory "inbox.org"))
         "* TODO [[%:link][%:description]]\n\n %i"
         :immediate-finish t)))

(defun jethro/org-inbox-capture ()
  (interactive)
  "Capture a task in agenda mode."
  (org-capture nil "i"))

(setq org-complete-tags-always-offer-all-agenda-tags t)
(setq org-tag-alist '(("@social" . ?s)
                      ("@work" . ?w)
                      ("@music" . ?m)
                      ("@fitness&health" . ?f)
                      ("@learning" . ?l)
                      ))
