roles/doom/files/.doom.d/config.org
** Org Roam
#+begin_src elisp 
(setq org-roam-directory (concat org-directory "roam/") )
(require 'org-roam-protocol)
(map! :leader
      :prefix "n"
      :desc "org-roam" "l" #'org-roam
      :desc "org-roam-insert" "i" #'org-roam-insert
      :desc "org-roam-switch-to-buffer" "b" #'org-roam-switch-to-buffer
      :desc "org-roam-find-file" "f" #'org-roam-find-file
      :desc "org-roam-show-graph" "g" #'org-roam-show-graph
      :desc "org-roam-capture" "c" #'org-roam-capture
      :desc "org-roam-deactivate-buffer" "d" #'org-roam-buffer-toggle-display)

(setq org-roam-tag-sources '(prop last-directory))
#+end_src
** Org Roam server
#+begin_src elisp :noweb-ref packages
(package! org-roam-server :recipe (:host github :repo "org-roam/org-roam-server" :files ("*")))
#+end_src

#+begin_src elisp
(use-package! org-roam-server
  :after ( org-roam server )
  :config
  (setq org-roam-server-host "127.0.0.1"
        org-roam-server-port 8080
        org-roam-server-export-inline-images t
        org-roam-server-authenticate nil
        )
  (defun org-roam-server-open ()
    "Ensure the server is active, then open the roam graph."
    (interactive)
    (org-roam-server-mode 1)
    (browse-url-xdg-open (format "http://localhost:%d" org-roam-server-port))))
#+end_src

*** Org roam capture templates

Roam supports capture functionality. We need to escape these by prepending a ',' before headings.
#+begin_src elisp :noweb-ref roam-templates

;; TODO template the main string
(setq org-roam-capture-templates
        '(("r" "read" plain (function org-roam--capture-get-point)
           "%?"
           :file-name "src/read/${slug}"
           :head "#+title: ${title}\n
#+roam_alias: \n
#+roam_tags: \n
,* ${title}\n
- source :: ${ref}\n
- links :: "
           :unnarrowed t)
          ("w" "web" plain (function org-roam--capture-get-point)
           "%?"
           :file-name "src/web/${slug}"
           :head "#+title: ${title}\n
#+roam_alias: \n
#+roam_tags: \n
,* ${title}\n
- source :: ${ref}\n
- links :: "
           :unnarrowed t)
          ("m" "media" plain (function org-roam--capture-get-point)
           "%?"
           :file-name "src/media/${slug}"
           :head "#+title: ${title}\n
#+roam_alias: \n
#+roam_tags: \n
,* ${title}\n
- source :: ${ref}\n
- links :: "
           :unnarrowed t)
          ("c" "concept" plain (function org-roam--capture-get-point)
           "%?"
           :file-name "${slug}"
           :head "#+title: ${title}\n
#+roam_alias: \n
#+roam_tags: \n
,* ${title}
- links :: "
           :unnarrowed t)))
  (setq org-roam-capture-ref-templates
        '(("r" "ref" plain (function org-roam-capture--get-point)
           "%?"
           :file-name "src/web/${slug}"
           :head "#+title: ${title}
#+roam_key: ${ref}
#+roam_tags: website
,* ${title}
- source :: ${ref}
- links :: "
           :unnarrowed t)))
#+end_src

** Org Pomodoro
#+begin_src elisp :noweb-ref roam-templates
;; TODO add hook to send notification to mobile when break ends

(setq org-pomodoro-length 50)
(setq org-pomodoro-short-break-length 10)
(setq org-pomodoro-long-break-length 10)
#+end_src
** Org-ref

#+begin_src elisp :noweb-ref roam-templates
(require 'org-ref)
(setq reftex-default-bibliography '("~/Workspace/Engineering-Thesis/paper/Bibliography.bib"))
(setq org-latex-pdf-process (list "latexmk -shell-escape -bibtex -f -pdf %f"))
#+end_src

* AUCTeX
** Appearance
Remove folding by default
#+begin_src elisp

(add-hook 'LaTeX-mode-hook (lambda ()
                             (TeX-fold-mode 1)))
#+end_src
* File templates

This is the place where the file templates live

** config.el
#+begin_src elisp :tangle config.el :noweb yes
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; DO NOT EDIT THIS FILE DIRECTLY
;; This is a file generated from a literate programing source file located at
;; https://gitlab.com/zzamboni/dot-doom/-/blob/master/doom.org
;; You should make any changes there and regenerate it from Emacs org-mode
;; using org-babel-tangle (C-c C-v t)

;; Place your private configuration here! Remember, you do not need to run 'doom
;; sync' after modifying this file!

;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets.
;; (setq user-full-name "John Doe"
;;      user-mail-address "john@doe.com")

;; Doom exposes five (optional) variables for controlling fonts in Doom. Here
;; are the three important ones:
;;
;; + `doom-font'
;; + `doom-variable-pitch-font'
;; + `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;;
;; They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
;; font string. You generally only need these two:
;; (setq doom-font (font-spec :family "monospace" :size 12 :weight 'semi-light)
;;       doom-variable-pitch-font (font-spec :family "sans" :size 13))

;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:
;; (setq doom-theme 'doom-one)

;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
;; (setq org-directory "~/org/")

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
;; (setq display-line-numbers-type t)

;; Here are some additional functions/macros that could help you configure Doom:
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package!' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
;; This will open documentation for it, including demos of how they are used.
;;
;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.


<<preamble>>
<<roam-templates>>
#+end_src
